{
  "item": [
    {
      "id": "https://www.upwork.com/jobs/Principal-Software-Engineer-Uruguay_%7E0123dd705749c6b645?source=rss",
      "title": "Principal Software Engineer - Uruguay - Upwork",
      "summary": "SOUTHWORKS is growing fast and hiring fast. We&rsquo;re not your average dev firm &ndash; so this is a great place to build your anything-but-average dev career.<br /><br />\nThis is where top developers get the opportunity to:<br /><br />\nBe the best &ndash; You&rsquo;ll work on elite three-person Fireteams with other sharp, skilled coders who know how to do top-notch, innovative work in record time.<br /><br />\nGrow like crazy &ndash; You&rsquo;ll take the next step in your career and have plenty of opportunities for professional development through weekly feedback sessions.<br /><br />\nTake on the challenge &ndash; You&rsquo;ll be tackling new things all the time, have the freedom to self-direct your own work, and get hands-on training with the latest technologies.<br /><br />\nMake a difference &ndash; You&rsquo;ll write code for some of the biggest brands in the world, and set a new standard for high-quality, high- profile projects.<br /><br />\nSOUTHWORKS aspires to be an organization that reflects the globally diverse audience that we serve. We believe that in addition to hiring the best talent, a diversity of perspectives, ideas and cultures leads to the creation of better products and services.<br /><br />\nSOUTHWORKS&#039; developers work on high- profile projects for some of the biggest brands in the world and set a new standard for high-quality. We&#039;re looking for developers who bring fresh ideas from all areas, including information retrieval, distributed computing, large-scale system design, networking and data storage, security, artificial intelligence, natural language processing, UI design and mobile; the list goes on and is growing every day. As a developer, you will work on a wide-variety of projects critical to our customers&#039; needs with opportunities to switch teams and projects as you and our fast-paced business grow and evolve. We need our developers to be versatile, display leadership qualities and be enthusiastic to take on new problems across the full-stack as we continue to push technology forward.<br /><br />\nAs a Principal Software Engineer at SOUTHWORKS, you&rsquo;ll lead software engineering projects for some of the biggest brands in the world and influence teams that design, develop, test, deploy, maintain, and improve software. You will plan requirements, identify risks, manage schedules, and communicate clearly with project stakeholders. And, you&rsquo;ll learn and grow alongside talented teammates who share your attention to detail and appetite for problem-solving.<br /><br />\nResponsibilities<br /><br />\nDesign, develop, test, deploy, maintain and improve software.<br />\nManage technology programs, defining milestones and success criteria, resource allocation and successful on-time delivery.<br />\nExercise technical judgment in working with multiple cross-functional teams.<br />\nDevelop tools and processes to improve software engineering productivity.<br />\nCommunicate schedules, priorities, and status to all levels in the company.<br />\nMentor and train other team members on design techniques, and coding standards.<br /><br />\nMinimum qualifications<br /><br />\nBS degree in Computer Science or equivalent practical experience.<br />\n8 year of experience with one or more general purpose programming languages including: Java, C/C++, C#, Objective C, Python, JavaScript or Go.<br />\nExperience working with one or more from the following: Infrastructure, Machine Learning, Mobile Application Development, Embedded Systems, Front End Development, Security and Privacy.<br />\nExperience architecting and developing large scale design.<br />\nExperience in Program Management on technical cross-functional projects.<br />\nWorking proficiency and communication skills in verbal and written English.<br />\nPassionate about technology.<br /><br />\nPreferred qualifications<br /><br />\nExperience managing execution and high quality product delivery.<br />\nAbility to exercise technical judgment in solving software engineering challenges.<br />\nAbility to be an influential member of a highly integrated team composed of both technical and non-technical members.<br />\nInterest and ability to learn other coding languages as needed.<br />\nFast learner who is comfortable figuring things out with new technology.<br />\nIs excited to work with cutting-edge technologies before they are public.<br /><br />\nAbout us<br /><br />\nSOUTHWORKS is the remote dev firm people turn to for their most complex, high-profile projects. You get great results without the endless hand-holding and do- overs outsourcing is known for. Too often when you bring in outsourced developers for help, you end up having to help them instead &ndash; so you spend all your time babysitting the project.<br /><br />\nTo make everything right, we bring a unique &ldquo;own it, bring it, prove it&rdquo; approach to software development. It&rsquo;s about thinking beyond the reqs, finding the fastest way to the best outcomes, and always keeping you in the know. And it&rsquo;s why companies such as Microsoft, Amazon, 7-Eleven, Discovery Networks, and even the Olympic Games count on us.<br /><br />\nSOUTHWORKS. Make everything right.<br /><br /><b>Budget</b>: $5\n<br /><b>Posted On</b>: August 21, 2020 21:06 UTC<br /><b>Category</b>: Full Stack Development<br /><b>Skills</b>:Amazon Web Services,     Website Development,     Vue.js,     Python,     ASP.NET,     Large (1000+ employees),     Web Application,     .NET Framework,     Node.js,     Java,     JavaScript,     AngularJS,     React,     Angular,     MongoDB    \n<br /><b>Country</b>: Australia\n<br /><a href=\"https://www.upwork.com/jobs/Principal-Software-Engineer-Uruguay_%7E0123dd705749c6b645?source=rss\">click to apply</a>\n",
      "categories": null,
      "link": "https://www.upwork.com/jobs/Principal-Software-Engineer-Uruguay_~0123dd705749c6b645?source=rss",
      "publishDate": "2020-08-21T21:06:28",
      "createdDate": "2020-08-22T19:12:23.749381+08:00"
    },
    {
      "id": "https://www.upwork.com/jobs/Principal-Software-Engineer-Uruguay_%7E0123dd705749c6b645?source=rss0",
      "title": "ERP Odoo / Dear Systems / or other Order management ERP POS - Upwork",
      "summary": "Looking for an experienced individual who has experience in working with either Odoo, Dear Systems, Netsuite, Microsoft Dynamics or similar cloud based ERP&#039;s<br /><br /><br /><b>Posted On</b>: August 21, 2020 23:10 UTC<br /><b>Category</b>: Back-End Development<br /><b>Skills</b>:ASP.NET,     ASP.NET MVC,     Database Design,     .NET Framework,     Git,     Google Analytics,     Infrastructure as Code,     Odoo,     POS Terminal Development,     Software Architecture &amp; Design,     SQL,     Web Services,     B2B,     API,     Architecture Design,     Automatic Deployment Pipeline,     Business Logic Layer,     Data Access Layer,     Database,     Database Architecture,     ERP Projects,     ERP Software,     HTTP,     Order Management,     PHP Script,     Python Script,     Requirements Specification,     RESTful API,     Database Maintenance,     Azure Cosmos DB,     MongoDB,     Microsoft SQL Server,     MySQL    \n<br /><b>Country</b>: United Kingdom\n<br /><a href=\"https://www.upwork.com/jobs/ERP-Odoo-Dear-Systems-other-Order-management-ERP-POS_%7E01133c1a3d086ca1f5?source=rss\">click to apply</a>\n",
      "categories": null,
      "link": "https://www.upwork.com/jobs/ERP-Odoo-Dear-Systems-other-Order-management-ERP-POS_~01133c1a3d086ca1f5?source=rss",
      "publishDate": "2020-08-21T23:10:25",
      "createdDate": "2020-08-22T19:12:23.7913197+08:00"
    },
    {
      "id": "https://www.upwork.com/jobs/Principal-Software-Engineer-Uruguay_%7E0123dd705749c6b645?source=rss1",
      "title": "change theme of .net project - Upwork",
      "summary": "web based library system, outlook of webpage should be changed, project written in .net C#, new skin html pages are ready, need to be changed from current to that new html, based on choosing theme for account, user can choose outlook of webpage, or in other words choose theme<br /><br /><b>Budget</b>: $50\n<br /><b>Posted On</b>: August 22, 2020 04:50 UTC<br /><b>Category</b>: Full Stack Development<br /><b>Skills</b>:ASP.NET,     .NET Framework    \n<br /><b>Country</b>: Malaysia\n<br /><a href=\"https://www.upwork.com/jobs/change-theme-net-project_%7E01a7ef7e21ee5a35cb?source=rss\">click to apply</a>\n",
      "categories": null,
      "link": "https://www.upwork.com/jobs/change-theme-net-project_~01a7ef7e21ee5a35cb?source=rss",
      "publishDate": "2020-08-22T04:50:45",
      "createdDate": "2020-08-22T19:12:23.7933591+08:00"
    },
    {
      "id": "https://www.upwork.com/jobs/Principal-Software-Engineer-Uruguay_%7E0123dd705749c6b645?source=rss2",
      "title": "NopCommerce 4.3 Complex Plugin Development - Upwork",
      "summary": "Technical Tasks<br /><br />\nCreate one or a series of plugins for NopCommerce 4.3 to support the following functionality.<br /><br /><br />\nProduct<br /><br />\nAdd product availability days of week to the Product Administration interface.<br /><br />\n- By default, the product is available everyday<br />\n- This feature will be used to determine whether the product shows up in Product lists, Filter, Search<br />\n- Dynamic tags, described below, will be built from tags of available products<br /><br />\nAdd this section of product interface to User Rights Administration.<br /><br /><br />\nExpensiveness Range<br /><br />\nAdd to the Administration interface an ability to set expensiveness ranges<br /><br />\n$ - set minimum and maximum bounds to determine the low cost<br />\n$$ - set minimum and maximum bounds to determine the mid cost<br />\n$$$ - set minimum and maximum bounds to determine the high cost<br /><br />\nThe expensiveness symbol will be used to determine the cost of items for vendors, for example:<br /><br />\n$ : 2 &ndash; 5<br />\n$$ : 5 &ndash; 10<br />\n$$$ : 10 &ndash; 20<br /><br />\nVendor has 10 items, the average cost of item is $7 and the vendor will be assigned $$ expensiveness symbol.<br /><br /><br />\nCategory (THIS SECTION IS NOT MANDATORY as it MIGHT not be achievable)<br /><br />\nAdd category special flags to the Category Administration interface.<br /><br />\n- By default, the Regular flag is unchecked<br />\n- There are two types of catalogs presented on the platform, regular and vendor; vendor catalog has it&rsquo;s own view and items in the vendor catalog have their own view; whereas lists and items in the regular catalog are displayed normally as without any changes described in this document.<br /><br />\nBasically, right now the platform has single views to display product search list, vendor list, vendor product list etc. Introducing the above change will create two types views, one type as described in this document and another as without any modifications.<br /><br />\nMust discuss this section, as it might be easier to create a link to a separately built platform for this &ldquo;Regular&rdquo; catalog.<br /><br />\nAdd this section of product interface to User Rights Administration.<br /><br /><br />\nVendor<br /><br />\nAdd additional fields to vendor.<br /><br />\n- Work hours, where user is allowed to purchase from vendor only during these hours. <br />\n- Pick up / Delivery availability<br />\n- Avatar image<br />\n- Coverage delivery radius, only applies when the delivery option is checked<br /><br /><br />\nVendor Page<br /><br />\nVendor has two additional properties:<br />\n- Tags<br />\n- Favourites group<br /><br />\nTags is a dynamically created field from the tags of currently available products this day. Most common tags are displayed first.<br /><br />\nFavourites group is a dynamically created group, it can be created in the background for each vendor at the end of the day. The group is created based on most sales and top rating of the products.<br /><br /><br />\nSearch Bar<br /><br />\nSearch bar contains two elements, Location search and Product search.<br /><br />\nLocation search uses API, i.e.: Google, to perform autocomplete and find an existing address from user entered address string or automatically determined address by the browser. This address will be used to submit the order, in case of delivery this address will be used as a delivery address.<br /><br />\nLocation of the user MUST be entered prior to getting a list of vendors and using product search element.<br /><br />\nOnce user enters an address the vendor list is displayed, it uses the following algorithm to fetch appropriate vendors:<br /><br />\n1. If vendor has a delivery option only, then algorithm checks the vendor delivery coverage radius to include the user selected location; Simple address to coordinate translation, coordinate subtraction and translation to kilometers should do it here; unless there exists a maps service API to calculate the distance between two addresses.<br />\n2. If vendor has a pick up option only, then algorithm checks the vendor coverage radius using the Address Search Limit set in the administration settings of Search Bar.<br />\n3. If vendor has both pick up and delivery options set, then use the delivery algorithm, but only if the delivery coverage radius is set, if it is not, then use the pick up algorithm<br /><br /><br />\nNotes<br /><br />\nInside the cart products are allowed only from one vendor, user cannot add products from multiple vendors. User must create different orders to purchase from different vendors.<br /><br /><b>Budget</b>: $380\n<br /><b>Posted On</b>: August 22, 2020 05:09 UTC<br /><b>Category</b>: Ecommerce Development<br /><b>Skills</b>:nopCommerce,     JavaScript,     ASP.NET,     Microsoft SQL Server,     Platform Plugin,     CSS,     HTML    \n<br /><b>Country</b>: Canada\n<br /><a href=\"https://www.upwork.com/jobs/NopCommerce-Complex-Plugin-Development_%7E01b02b29e814aa0e03?source=rss\">click to apply</a>\n",
      "categories": null,
      "link": "https://www.upwork.com/jobs/NopCommerce-Complex-Plugin-Development_~01b02b29e814aa0e03?source=rss",
      "publishDate": "2020-08-22T05:09:37",
      "createdDate": "2020-08-22T19:12:23.7971162+08:00"
    },
    {
      "id": "https://www.upwork.com/jobs/Principal-Software-Engineer-Uruguay_%7E0123dd705749c6b645?source=rss3",
      "title": "Full Stack ASP.Net Core and Angular 6 GURU Needed - Upwork",
      "summary": "Required GURU Skills<br /><br />\nASP.Net Core MVC &amp;amp; Web API<br />\n.Net Identity Server 4<br />\nAngular 6 (with .net and stand alone frontend application)<br />\nMongoDB<br />\nSQL Server<br />\nGit / Azure Devops<br />\nAJAX<br />\nBootstrap<br />\nSignlarR<br />\nSAAS Multi Tenant Application Architecture<br /><br />\nREQUIRED:<br />\nThis project requires you to work with teamviewer screen sharing.&nbsp;&nbsp;If you are not ok with working with teamviewer screen sharing, please do not apply.<br /><br /><br /><b>Posted On</b>: August 22, 2020 06:56 UTC<br /><b>Category</b>: Full Stack Development<br /><b>Skills</b>:AJAX,     AngularJS,     ASP.NET,     ASP.NET Core,     ASP.NET Web API,     Bootstrap,     CSS,     .NET Framework,     HTML,     jQuery,     RESTful,     SaaS,     API Integration,     UX/UI,     MongoDB,     Microsoft SQL Server,     Angular    \n<br /><b>Country</b>: United States\n<br /><a href=\"https://www.upwork.com/jobs/Full-Stack-ASP-Net-Core-and-Angular-GURU-Needed_%7E0113faba73ca6161f7?source=rss\">click to apply</a>\n",
      "categories": null,
      "link": "https://www.upwork.com/jobs/Full-Stack-ASP-Net-Core-and-Angular-GURU-Needed_~0113faba73ca6161f7?source=rss",
      "publishDate": "2020-08-22T06:56:39",
      "createdDate": "2020-08-22T19:12:23.8000829+08:00"
    },
    {
      "id": "https://www.upwork.com/jobs/Principal-Software-Engineer-Uruguay_%7E0123dd705749c6b645?source=rss4",
      "title": "Ecommerce Development - Upwork",
      "summary": "I am building an eCommerce site for my brand, Choose Something. Choose Something is a concept inspired by this years election. I wanted to bring people together to help them choose to VOTE by designing t-shirts. The customer will have a choice of two different Choose Something t-shirt designs. $10.00 of each t-shirt will go to either the DNC or the RNC. The customer chooses which one they want their $10.00 to go to.&nbsp;&nbsp;I am looking for someone to finish building my Ecommerce store on Shopify; code donation buttons, know how to add an automatic email option when customer&#039;s subscribe/sign up on my password page, etc. We would be working together. I know basics but need someone who can work faster and is more knowledgable; someone who can do what takes me 10 hours, they can do in 2-3 hrs.<br /><br /><b>Budget</b>: $200\n<br /><b>Posted On</b>: August 22, 2020 07:07 UTC<br /><b>Category</b>: Ecommerce Development<br /><b>Skills</b>:Joomla,     LevelDB,     PHP,     WordPress Plugin,     Responsive Design,     Theme Development,     Website Customization,     Maintenance,     SQLite,     Template,     OpenCart,     Angular,     Squarespace,     Ruby,     Stripe,     PSD to Wordpress,     Realm Database,     WooCommerce,     Magento,     Azure Cosmos DB,     Startup,     App Development,     Ecommerce Platform Development,     AngularJS,     Shopify,     WePay,     Wix,     Vue.js,     WordPress,     Web Design,     CSS,     Liquid,     Website Migration,     Java,     Landing Page,     Bug Fixes,     PaperDb,     JavaScript,     MySQL,     React,     PrestaShop,     PayPal,     Platform Plugin,     Theme Customization,     API Integration,     Design Enhancement,     Website Optimization,     Couchbase,     Python,     ASP.NET,     Authorize.Net,     Laravel,     eCommerce Website,     Shopify Templates,     BigCommerce,     HTML,     ClickFunnels,     Node.js,     Bootstrap,     jQuery,     jQuery Mobile,     CSS3,     Web Design,     HTML5,     Ruby on Rails,     Magento 2    \n<br /><b>Country</b>: United States\n<br /><a href=\"https://www.upwork.com/jobs/Ecommerce-Development_%7E012f72750e29c66562?source=rss\">click to apply</a>\n",
      "categories": null,
      "link": "https://www.upwork.com/jobs/Ecommerce-Development_~012f72750e29c66562?source=rss",
      "publishDate": "2020-08-22T07:07:41",
      "createdDate": "2020-08-22T19:12:23.8029008+08:00"
    },
    {
      "id": "https://www.upwork.com/jobs/Principal-Software-Engineer-Uruguay_%7E0123dd705749c6b645?source=rss5",
      "title": "Developer needed for creating soap web service for ms project server integration - Upwork",
      "summary": "We have the ms project server installation with custom database and custom web-parts, VSTO for project pro. Now we have an integration task with data bus. Data bus have soap web service. We need one with the same wsdl. Data write/read code we will develope without help. We need web service template.<br /><br /><br /><b>Posted On</b>: August 22, 2020 08:21 UTC<br /><b>Category</b>: Full Stack Development<br /><b>Skills</b>:ASP.NET,     Microsoft IIS,     API Integration,     C#    \n<br /><b>Country</b>: Russia\n<br /><a href=\"https://www.upwork.com/jobs/Developer-needed-for-creating-soap-web-service-for-project-server-integration_%7E01ac961fe81384e730?source=rss\">click to apply</a>\n",
      "categories": null,
      "link": "https://www.upwork.com/jobs/Developer-needed-for-creating-soap-web-service-for-project-server-integration_~01ac961fe81384e730?source=rss",
      "publishDate": "2020-08-22T08:21:29",
      "createdDate": "2020-08-22T19:12:23.8528631+08:00"
    },
    {
      "id": "https://www.upwork.com/jobs/Principal-Software-Engineer-Uruguay_%7E0123dd705749c6b645?source=rss6",
      "title": "nopCommerce custom theme development. - Upwork",
      "summary": "We are looking for UI &amp;amp; UX experts to develop a custom theme for nopCommerce, I will be providing the Graphics designs as images. <br /><br />\nPlease apply to this job only by the experts who have relevant long term knowledge in the nopcommerce platform.<br /><br /><b>Budget</b>: $250\n<br /><b>Posted On</b>: August 22, 2020 08:58 UTC<br /><b>Category</b>: Ecommerce Development<br /><b>Skills</b>:nopCommerce,     jQuery,     JavaScript,     ASP.NET,     MySQL,     CSS3,     Web Design,     Microsoft SQL Server,     CSS,     Web Design,     HTML5    \n<br /><b>Country</b>: India\n<br /><a href=\"https://www.upwork.com/jobs/nopCommerce-custom-theme-development_%7E01396dd0556ec50dbc?source=rss\">click to apply</a>\n",
      "categories": null,
      "link": "https://www.upwork.com/jobs/nopCommerce-custom-theme-development_~01396dd0556ec50dbc?source=rss",
      "publishDate": "2020-08-22T08:58:42",
      "createdDate": "2020-08-22T19:12:23.8612935+08:00"
    },
    {
      "id": "https://www.upwork.com/jobs/Principal-Software-Engineer-Uruguay_%7E0123dd705749c6b645?source=rss7",
      "title": "nopCommerce Storefront Sales Dashboard plugin for Vendors. - Upwork",
      "summary": "Need to develop a Storefront nopCommerce plug-in, for in which the Vendors could see the Dashboard, Orders, Sales, Shipments, Customers, etc, and all the necessary things to manage Orders, Shipments, Products, Customers, etc.<br /><br />\nThis plugin is basically intended to simply bring the Admin panel items to Store front&rsquo;s My Account area. The idea is to not give the traditional nopCommerce Admin panel access directly for the Vendors. But all the security things need to be considered while bringing the items to the Storefront.<br /><br />\nMilestones:<br /><br />\nSplit up the task and list the milestones first before starting to work, I will provide the repository for check-in on a daily basis.<br /><br />\nDeliverables: <br /><br />\nFully buildable source code of the plugin for 4.2 and 4.30 versions and both binary and dependency DLLs.<br /><br />\nAll deliverables should be checked into the repository at the end of the project.<br /><br /><b>Budget</b>: $250\n<br /><b>Posted On</b>: August 22, 2020 09:00 UTC<br /><b>Category</b>: Ecommerce Development<br /><b>Skills</b>:Bootstrap,     nopCommerce,     jQuery,     JavaScript,     ASP.NET,     MySQL,     Web Design,     Microsoft SQL Server,     CSS,     Web Design,     HTML5    \n<br /><b>Country</b>: India\n<br /><a href=\"https://www.upwork.com/jobs/nopCommerce-Storefront-Sales-Dashboard-plugin-for-Vendors_%7E0102f656789c9570a2?source=rss\">click to apply</a>\n",
      "categories": null,
      "link": "https://www.upwork.com/jobs/nopCommerce-Storefront-Sales-Dashboard-plugin-for-Vendors_~0102f656789c9570a2?source=rss",
      "publishDate": "2020-08-22T09:00:26",
      "createdDate": "2020-08-22T19:12:23.8645186+08:00"
    },
    {
      "id": "https://www.upwork.com/jobs/Principal-Software-Engineer-Uruguay_%7E0123dd705749c6b645?source=rss8",
      "title": "Full time .net /web dev Unity Apps dev - Upwork",
      "summary": "Need a full time resource having minimum 2.5 years&nbsp;&nbsp;hands on experience .net and unity . <br />\n.Net VS exp <br />\nUnity <br />\nApps development<br />\nWeb Back end&nbsp;&nbsp;<br />\nSql Server <br />\nDeployment<br /><br /><b>Budget</b>: $100\n<br /><b>Posted On</b>: August 22, 2020 10:43 UTC<br /><b>Category</b>: Full Stack Development<br /><b>Skills</b>:Database Architecture,     Amazon Web Services,     ASP.NET,     eCommerce Website,     .NET Framework,     UX/UI,     API,     Database Design,     Bootstrap,     AngularJS,     MySQL,     Angular,     Web Design,     API Integration    \n<br /><b>Country</b>: Saudi Arabia\n<br /><a href=\"https://www.upwork.com/jobs/Full-time-net-web-dev-Unity-Apps-dev_%7E010c35146dfdd82002?source=rss\">click to apply</a>\n",
      "categories": null,
      "link": "https://www.upwork.com/jobs/Full-time-net-web-dev-Unity-Apps-dev_~010c35146dfdd82002?source=rss",
      "publishDate": "2020-08-22T10:43:12",
      "createdDate": "2020-08-22T19:12:23.8670526+08:00"
    }
  ]
}